povdoigt/SP-02/KODE/STM32_TEST/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32l4xx_hal.h"
#include "usart.h"
#include "gpio.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "STS.h"
#include "tools.h"
#include <stdint.h>
#include <string.h>
#include <stdio.h>
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
/* USER CODE BEGIN PFP */
void Wit_UART_Write(uint8_t *p_ucData, uint32_t uiLen);
void Wit_Reg_Update_Cb(uint32_t uiReg, uint32_t uiRegNum);
void Wit_Delayms(uint16_t ucMs);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
int _write(int file, char *ptr, int len) {
	int DataIdx;
	for (DataIdx = 0; DataIdx < len; DataIdx++) {
		ITM_SendChar(*ptr++);
	}
	return len;
}

void Wit_UART_Write(uint8_t *p_ucData, uint32_t uiLen) {
  HAL_UART_Transmit(&huart1, p_ucData, uiLen, HAL_MAX_DELAY);
}

void Wit_Reg_Update_Cb(uint32_t uiReg, uint32_t uiRegNum) {
  // Callback function implementation
}

void Wit_Delayms(uint16_t ucMs) {
  HAL_Delay(ucMs);
}

void ftUart_Send(uint8_t *nDat, int nLen) {
  HAL_UART_Transmit(&huart3, nDat, nLen, HAL_MAX_DELAY);
}
int ftUart_Read(uint8_t *nDat, int nLen) {
  uint16_t rx_len;
  HAL_UARTEx_ReceiveToIdle(&huart3, nDat, nLen, &rx_len, HAL_MAX_DELAY);
  return (int)rx_len;
}
void ftBus_Delay(void) {
  HAL_Delay(1);
}




uint8_t compute_checksum(uint8_t *data, uint8_t length) {
  uint8_t sum = 0;
  for (uint8_t i = 0; i < length; i++) {
    sum += data[i];
  }
  return ~sum;
}





/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART2_UART_Init();
  MX_USART1_UART_Init();
  MX_USART3_UART_Init();
  /* USER CODE BEGIN 2 */

  HAL_StatusTypeDef res;

  res = STS_UART_Port_Init(&huart_sts_port1, &huart3);
  if (res != HAL_OK) {
      // Initialization failed
      Error_Handler();
  }

  STS_Servo_t servo1;
  res = STS_Servo_Init(&servo1, &huart_sts_port1, 1);
  if (res != HAL_OK) {
      // Initialization failed
      Error_Handler();
  }
  HAL_Delay(1);
  STS_Servo_SetGoalPosition(&servo1, 0);

  STS_Servo_Current_raw_t current_raw_status;
  STS_Servo_Current_t current_status;
  uint8_t is_moving = 0;
  uint16_t next_position = 4095;

  uint8_t usb_buff[256];
  char position_str[10];
  char speed_str[10];
  char load_str[10];
  char voltage_str[10];
  char temperature_str[10];
  char current_str[10];

  uint32_t t0 = HAL_GetTick();

  HAL_Delay(10); // Wait for servo to stabilize
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
	while (1) {
    STS_Servo_GetCurrentStatus(&servo1, &current_raw_status);
    HAL_Delay(1);
    STS_Servo_IsMoving(&servo1, &is_moving);
  
    STS_Servo_raw_to_physical(&current_raw_status, &current_status);

    float_format(position_str   , current_status.position   , 4, 10);
    float_format(speed_str      , current_status.speed      , 4, 10);
    float_format(load_str       , current_status.load       , 4, 10);
    float_format(voltage_str    , current_status.voltage    , 2,  6);
    float_format(temperature_str, current_status.temperature, 2,  6);
    float_format(current_str    , current_status.current    , 2,  6);

    sprintf((char*)usb_buff, "Move: %1d, Pos: %10s deg, Speed: %10s RPM, Load: %10s, Volt: %6s V, Temp: %6s C, Curr: %6s mA\r\n",
            is_moving, position_str, speed_str, load_str, voltage_str, temperature_str, current_str);
    HAL_UART_Transmit(&huart2, usb_buff, strlen((char*)usb_buff), HAL_MAX_DELAY);

    HAL_Delay(1);
    if (is_moving == 0 && (HAL_GetTick() - t0) > 5000) {
      STS_Servo_SetGoalPosition(&servo1, next_position);
      next_position = (next_position == 0) ? 2 * 4095 : 0;
      t0 = HAL_GetTick();
    }
    HAL_Delay(10);

    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
	}
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  if (HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLM = 1;
  RCC_OscInitStruct.PLL.PLLN = 10;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV7;
  RCC_OscInitStruct.PLL.PLLQ = RCC_PLLQ_DIV2;
  RCC_OscInitStruct.PLL.PLLR = RCC_PLLR_DIV2;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_4) != HAL_OK)
  {
    Error_Handler();
  }
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
